Configuration/InformationRegisters/ЗначенияТехническихХарактеристикМоделей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияТехническихХарактеристикМоделей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТехническиеХарактеристикиОборудования</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МодельОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТехническиеХарактеристикиОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МодельОборудования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Catalogs/КатегорииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КатегорииНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТехническиеХарактеристикиОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/CommonModules/ТехническиеХарактеристикиСервер/Ext/Module.bsl
Процедура ЗаписатьЗначенияХарактеристикМодели(МодельОборудования, ЗначенияХарактеристик) Экспорт
	
	Если МодельОборудования.Категория.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.МодельОборудования Тогда
		ВызватьИсключение "Технические характеристики можно задавать только для моделей оборудования.";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Характеристики.Характеристика КАК Характеристика,
		|	Характеристики.Обязательная КАК Обязательная
		|ИЗ
		|	Справочник.КатегорииНоменклатуры.Характеристики КАК Характеристики
		|ГДЕ
		|	Характеристики.Ссылка = &КатегорияНоменклатуры";
	
	Запрос.УстановитьПараметр("КатегорияНоменклатуры", МодельОборудования.Категория);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	РазрешенныеХарактеристики = Новый Соответствие;
	ОбязательныеХарактеристики = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		РазрешенныеХарактеристики.Вставить(Выборка.Характеристика, Выборка.Обязательная);
		
		Если Выборка.Обязательная Тогда
			ОбязательныеХарактеристики.Вставить(Выборка.Характеристика, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	СписокОшибок = Новый Массив;
	ПолученныеХарактеристики = Новый Соответствие;
	
	Для Каждого ЭлементХарактеристики Из ЗначенияХарактеристик Цикл
		
		ПризнакОбязательности = РазрешенныеХарактеристики.Получить(ЭлементХарактеристики.Характеристика);
		
		Если ПризнакОбязательности = Неопределено Тогда
			СписокОшибок.Добавить(СтрШаблон("Характеристика ""%1"" не разрешена для категории ""%2"".",
					ЭлементХарактеристики.Характеристика,
					МодельОборудования.Категория));
			
		ИначеЕсли ПризнакОбязательности Тогда
			
			// Для числовых и булевых характеристик 0 и Ложь являются
			// допустимыми значениями, поэтому их заполненность определяется
			// наличием соответствующей строки в наборе.
			ТипЗначенияХарактеристики = ТипЗнч(ЭлементХарактеристики.Значение);
			
			Если ТипЗначенияХарактеристики = Тип("Строка")
				ИЛИ ТипЗначенияХарактеристики = Тип("Дата") Тогда
				Если НЕ ЗначениеЗаполнено(ЭлементХарактеристики.Значение) Тогда
					СписокОшибок.Добавить(СтрШаблон("Обязательная характеристика ""%1"" не заполнена.",
							ЭлементХарактеристики.Характеристика));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ПолученныеХарактеристики.Получить(
			ЭлементХарактеристики.Характеристика) <> Неопределено Тогда
			СписокОшибок.Добавить(СтрШаблон("Характеристика ""%1"" указана более одного раза.",
					ЭлементХарактеристики.Характеристика));
		Иначе
			ПолученныеХарактеристики.Вставить(ЭлементХарактеристики.Характеристика,Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОбязательнаяХарактеристика Из ОбязательныеХарактеристики Цикл
		
		Если ПолученныеХарактеристики.Получить(ОбязательнаяХарактеристика.Ключ) = Неопределено Тогда
			СписокОшибок.Добавить(
				СтрШаблон("Обязательная характеристика ""%1"" отсутствует для категории ""%2"".",
					ОбязательнаяХарактеристика.Ключ,
					МодельОборудования.Категория));
		КонецЕсли;
	КонецЦикла;
	
	Если СписокОшибок.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(СписокОшибок, Символы.ПС);
	КонецЕсли;
	
	// Переданный набор является полным актуальным набором характеристик модели.
	// Отбор по модели позволяет заменить только ее записи, не затрагивая
	// характеристики других моделей оборудования.
	НаборЗаписей = РегистрыСведений.ЗначенияТехническихХарактеристикМоделей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.МодельОборудования.Установить(МодельОборудования);
	
	Для Каждого ЭлементХарактеристики Из ЗначенияХарактеристик Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.МодельОборудования = МодельОборудования;
		НоваяЗапись.Характеристика = ЭлементХарактеристики.Характеристика;
		НоваяЗапись.Значение = ЭлементХарактеристики.Значение;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры


Функция НайтиМоделиПоХарактеристикам(УсловияПоиска) Экспорт
	
	Если УсловияПоиска.Количество() = 0 Тогда
		
		Результат = Новый ТаблицаЗначений;
		Результат.Колонки.Добавить("МодельОборудования", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		
		Возврат Результат;
		
	КонецЕсли;
	
	// Модель соответствует условиям поиска только тогда, когда количество
	// совпавших значений равно общему количеству переданных условий.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Условия.Характеристика КАК Характеристика,
		|	Условия.Значение КАК Значение
		|ПОМЕСТИТЬ Условия
		|ИЗ
		|	&УсловияПоиска КАК Условия;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаписиЗначений.МодельОборудования КАК МодельОборудования
		|ИЗ
		|	Условия КАК Условия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|			РегистрСведений.ЗначенияТехническихХарактеристикМоделей КАК ЗаписиЗначений
		|		ПО Условия.Характеристика = ЗаписиЗначений.Характеристика
		|			И Условия.Значение = ЗаписиЗначений.Значение
		|СГРУППИРОВАТЬ ПО
		|	ЗаписиЗначений.МодельОборудования
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(*) = &КоличествоУсловий";
	
	Запрос.УстановитьПараметр("УсловияПоиска", УсловияПоиска);
	Запрос.УстановитьПараметр("КоличествоУсловий", УсловияПоиска.Количество());
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции
